tsung_load_test.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">
  <clients>
    <client host="localhost" maxusers="32768" use_controller_vm="true" />
  </clients>

  <servers>
    <server host="ylnew.eba-vxqrh727.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>

  <load>
    <arrivalphase phase="1" duration="30" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="30" unit="second">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="3" duration="30" unit="second">
      <users arrivalrate="4" unit="second"></users>
    </arrivalphase>
    <!-- <arrivalphase phase="4" duration="30" unit="second">
      <users arrivalrate="8" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="5" duration="30" unit="second">
      <users arrivalrate="16" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="6" duration="30" unit="second">
      <users arrivalrate="32" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="7" duration="30" unit="second">
      <users arrivalrate="64" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="8" duration="30" unit="second">
      <users arrivalrate="128" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="9" duration="30" unit="second">
      <users arrivalrate="256" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="10" duration="30" unit="second">
      <users arrivalrate="512" unit="second"></users>
    </arrivalphase> -->
  </load>

  <options>
    <option name="global_ack_timeout" value="3000"></option>
  </options>

  <sessions>

    <session name="example" type="ts_http" weight="1">
      <request><http method="GET" url="/"></http></request>
    </session>


    <!-- <session name="user_workflow" weight="3" type="ts_http">
      <setdynvars sourcetype="random_number" start="1" end="100">
        <var name="rand_user"/>
      </setdynvars>

      <request>
        <dyn_variable name="authenticity_token"></dyn_variable>
        <http method="GET" url="/login"></http>
      </request>

      <setdynvars code='fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,"[+]","%2B",[global,{return,list}]) end.' sourcetype="eval">
        <var name="authenticity_token" />
      </setdynvars>

      <request subst="true">
        <http url="/signup" version="1.1" method="POST"
          contents="username=test_user%%_rand_user%%&amp;authenticity_token=%%_authenticity_token%%&amp;password=123456789"
          content_type="application/x-www-form-urlencoded">
        </http>
      </request>
      <thinktime value="3" random="true"/>

      <request subst="true">
        <http url="/posts" method="GET"/>
      </request>
      <thinktime value="5" random="true"/>

      <request subst="true">
        <http url="/meetings" method="GET"/>
      </request>
      <thinktime value="2" random="true"/>

      <request subst="true">
        <http url="/profile" method="GET"/>
      </request>
      <thinktime value="3" random="true"/>
    </session> -->
  </sessions>
</tsung>